# IDuctFittingAndAccessoryPressureDropUIServer Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IDuctFittingAndAccessoryPressureDropUIServer Members
IDuctFittingAndAccessoryPressureDropUIServer Interface Methods See Also
---
The IDuctFittingAndAccessoryPressureDropUIServer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetDBServerId | Returns the Id of the corresponding DB server for which this server provides an optional UI. |
| GetDescription | Implement this method to return a description of the server.  (Inherited from IExternalServer.) |
| GetName | Implement this method to return the name of the server.  (Inherited from IExternalServer.) |
| GetServerId | Implement this method to return the id of the server.  (Inherited from IExternalServer.) |
| GetServiceId | Implement this method to return the id of the service.  (Inherited from IExternalServer.) |
| GetVendorId | Implement this method to return the id of the vendor of the server.  (Inherited from IExternalServer.) |
| ShowSettings | Shows the settings UI. |

# See Also
IDuctFittingAndAccessoryPressureDropUIServer Interface
Autodesk.Revit.UI.Mechanical Namespace